I built `master` locally using go 1.15.3 and it works on both a pre-AVX machine and a AVX2 machine:

### Pre-AVX (Mid-2010 MacPro)

```
$ sysctl -n machdep.cpu.brand_string
Intel(R) Xeon(R) CPU           X5650  @ 2.67GHz

$ go version
go version go1.14.7 darwin/amd64

$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.test will be created
  + resource "random_id" "test" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_id.test: Creating...
random_id.test: Creation complete after 0s [id=SBCw_k6odGg]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

test = SBCw/k6odGg=
```


### With AVX2 (Current MacBook Pro)

```
$ sysctl -n machdep.cpu.brand_string
Intel(R) Core(TM) i9-9880H CPU @ 2.30GHz

$ go version
go version go1.15.3 darwin/amd64

$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.test will be created
  + resource "random_id" "test" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_id.test: Creating...
random_id.test: Creation complete after 0s [id=w7FYRyhBo7U]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

test = w7FYRyhBo7U=
```